app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def new
    @book = Book.new
    @books = Book.all
    @books = @books.select{|book| book.user_id == current_user.id}

INSERT INTO "books" ("created_at", "updated_at", "title", "body", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2019-01-24 05:14:31.774698"], ["updated_at", "2019-01-24 05:14:31.774698"], ["title", "fdd"], ["body", "vb"], ["user_id", 8]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
       flash[:notice] = "Book was successfully created."
       redirect_to book_path(@book)
    else
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
---
  def info
    book = Book.find(params[:id])