app/controllers/post_images_controller.rb

   def create
   	@post_image = PostImage.new(post_image_params)
    @post_image.user_id = current_user.id
        if @post_image.save
---
INSERT INTO "post_images" ("shop_name", "image_id", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

   def index
    @post_images = PostImage.page(params[:page]).reverse_order
---
SELECT  "post_images".* FROM "post_images" ORDER BY "post_images"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "post_images"