app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "user_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "imaivf"], ["user_image_id", "769b30a338a3f6f5417d90fc4445202abf10a64aa5bbd45af220a55e2e90"], ["introduction", "vffgnhgfffeg vf"], ["updated_at", "2019-01-26 09:12:53.042033"], ["id", 8]]
---
  def update
  	@user = User.find(params[:id])
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def info
    @user = User.find(params[:id])