app/views/post_images/show.html.erb

      <ol>
    <% @post_image.post_comments.each do |post_comment| %>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 1]]

      <i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
      <%= @post_image.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_image_id" = ?  [["post_image_id", 1]]

        <div class="float-wrapper">
        <h2 class="comment-count"><%= @post_image.post_comments.count %>件コメント</h2>
---
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 1]]